<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"73d91df24bf728f7f40cdc5bab2946d7433b9981c293ea64adcf55e76f6432ea","plan_job_ref":"Job Environment Main - Plan #431 at https://github.com/jarrod-lowe/wildsea/actions/runs/11416172385","plan_out_hash":"2b47dd15009b07804ac703e038d9e593bd7d388a968456d29e8904703db7b18b","plan_hash":"61b691f7f11eddcdb69ac95691bf69f80aca62be44589bc58b8c116cd1f0be14","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name       = "wildsea.lowe.kiwi"
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 9 to add, 5 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.ui will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ui" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "CDNRead"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
            ]
+           sid       = "CDNList"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               "arn:aws:s3:::wildsea-primary-ui",
+               "arn:aws:s3:::wildsea-primary-ui/*",
            ]
+           sid       = "BlockHTTP"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.wildsea.aws_acm_certificate.api will be created
+   resource "aws_acm_certificate" "api" {
+       arn                       = (known after apply)
+       domain_name               = "api-wildsea-primary.wildsea.lowe.kiwi"
+       domain_validation_options = [
+           {
+               domain_name           = "api-wildsea-primary.wildsea.lowe.kiwi"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "api-wildsea-primary.wildsea.lowe.kiwi",
        ]
+       tags_all                  = {
+           "Application" = "Wildsea-primary"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.wildsea.aws_acm_certificate.cdn will be created
+   resource "aws_acm_certificate" "cdn" {
+       arn                       = (known after apply)
+       domain_name               = "wildsea.lowe.kiwi"
+       domain_validation_options = [
+           {
+               domain_name           = "wildsea.lowe.kiwi"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "wildsea.lowe.kiwi",
        ]
+       tags_all                  = {
+           "Application" = "Wildsea-primary"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.wildsea.aws_acm_certificate_validation.cdn will be created
+   resource "aws_acm_certificate_validation" "cdn" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.wildsea.aws_appsync_domain_name.api will be created
+   resource "aws_appsync_domain_name" "api" {
+       appsync_domain_name = (known after apply)
+       certificate_arn     = (known after apply)
+       domain_name         = "api-wildsea-primary.wildsea.lowe.kiwi"
+       hosted_zone_id      = (known after apply)
+       id                  = (known after apply)
    }

  # module.wildsea.aws_appsync_domain_name_api_association.api will be created
+   resource "aws_appsync_domain_name_api_association" "api" {
+       api_id      = "**************************"
+       domain_name = "api-wildsea-primary.wildsea.lowe.kiwi"
+       id          = (known after apply)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (12 unchanged attributes hidden)

!~      log_config {
!~          field_log_level          = "ERROR" -> "ALL"
#            (2 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_cloudfront_distribution.cdn will be updated in-place
!~  resource "aws_cloudfront_distribution" "cdn" {
!~      aliases                         = [
+           "wildsea.lowe.kiwi",
        ]
        id                              = "E2KPUTZ78NDDZ6"
        tags                            = {
            "Name" = "Wildsea-primary-cdn"
        }
#        (21 unchanged attributes hidden)

!~      viewer_certificate {
+           acm_certificate_arn            = (known after apply)
-           cloudfront_default_certificate = true -> null
!~          minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
+           ssl_support_method             = "sni-only"
#            (1 unchanged attribute hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # module.wildsea.aws_cognito_user_pool_client.cognito will be updated in-place
!~  resource "aws_cognito_user_pool_client" "cognito" {
!~      callback_urls                                 = [
-           "https://d3tinvgatp7lle.cloudfront.net/",
+           "https://wildsea.lowe.kiwi/",
#            (1 unchanged element hidden)
        ]
        id                                            = "1ghmru9nk0j81l040lehbgosv1"
!~      logout_urls                                   = [
-           "https://d3tinvgatp7lle.cloudfront.net/",
+           "https://wildsea.lowe.kiwi/",
#            (1 unchanged element hidden)
        ]
        name                                          = "Wildsea-primary"
#        (18 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_route53_record.api will be created
+   resource "aws_route53_record" "api" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api-wildsea-primary.wildsea.lowe.kiwi"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.wildsea.aws_route53_record.api_validate["api-wildsea-primary.wildsea.lowe.kiwi"] will be created
+   resource "aws_route53_record" "api_validate" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.wildsea.aws_route53_record.cdn will be created
+   resource "aws_route53_record" "cdn" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "wildsea.lowe.kiwi"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = false
+           name                   = "d3tinvgatp7lle.cloudfront.net"
+           zone_id                = "**************"
        }
    }

  # module.wildsea.aws_route53_record.cdn_validate["wildsea.lowe.kiwi"] will be created
+   resource "aws_route53_record" "cdn_validate" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.wildsea.aws_s3_bucket_policy.ui will be updated in-place
!~  resource "aws_s3_bucket_policy" "ui" {
        id     = "wildsea-primary-ui"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui/*"
-                       Sid       = "CDNRead"
                    },
-                   {
-                       Action    = "s3:ListBucket"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceArn" = "arn:aws:cloudfront::021891603679:distribution/E2KPUTZ78NDDZ6"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::wildsea-primary-ui"
-                       Sid       = "CDNList"
                    },
-                   {
-                       Action    = "s3:*"
-                       Condition = {
-                           Bool = {
-                               "aws:SecureTransport" = "false"
                            }
                        }
-                       Effect    = "Deny"
-                       Principal = {
-                           AWS = "*"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::wildsea-primary-ui/*",
-                           "arn:aws:s3:::wildsea-primary-ui",
                        ]
-                       Sid       = "BlockHTTP"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 9 to add, 5 to change, 0 to destroy.

Changes to Outputs:
!~  graphql_uri              = "https://2xdx2rdnwjbyznwjz4nc54dzbi.appsync-api.ap-southeast-2.amazonaws.com/graphql" -> "https://api-wildsea-primary.wildsea.lowe.kiwi/graphql"
```
</details>

:memo: Plan generated in [Environment Main - Plan #431](https://github.com/jarrod-lowe/wildsea/actions/runs/11416172385)